docs/performance-tests/load-test-results/stress-20251018-022356/raw/00_warmup_health.txt
This is ApacheBench, Version 2.3 <$Revision: 1913912 $>
Copyright 1996 Adam Twiss, Zeus Technology Ltd, http://www.zeustech.net/
Licensed to The Apache Software Foundation, http://www.apache.org/

Benchmarking localhost (be patient)
Completed 100 requests
Completed 200 requests
Completed 300 requests
Completed 400 requests
Completed 500 requests
Finished 500 requests


Server Software:        
Server Hostname:        localhost
Server Port:            8080

Document Path:          /public/health
Document Length:        148 bytes

Concurrency Level:      20
Time taken for tests:   0.045 seconds
Complete requests:      500
Failed requests:        0
Keep-Alive requests:    0
Total transferred:      126500 bytes
HTML transferred:       74000 bytes
Requests per second:    11030.22 [#/sec] (mean)
Time per request:       1.813 [ms] (mean)
Time per request:       0.091 [ms] (mean, across all concurrent requests)
Transfer rate:          2725.24 [Kbytes/sec] received

Connection Times (ms)
              min  mean[+/-sd] median   max
Connect:        0    0   0.2      1       1
Processing:     0    1   0.7      1       4
Waiting:        0    1   0.6      1       4
Total:          0    2   0.7      1       5
ERROR: The median and mean for the initial connection time are more than twice the standard
       deviation apart. These results are NOT reliable.
WARNING: The median and mean for the total time are not within a normal deviation
        These results are probably not that reliable.

Percentage of the requests served within a certain time (ms)
  50%      1
  66%      2
  75%      2
  80%      2
  90%      3
  95%      3
  98%      4
  99%      4
 100%      5 (longest request)